from turtle import *

Screen().setup(1.0, 1.0)
delay(50)

# переносимось на кординати човна
up()
goto(-30, -150)
down()

# малюємо човен
goto(-50, -200)
goto(-140, -200)
goto(-160, -150)
goto(-30, -150)

#переносимось на кординати щогли
up()
goto(-90, -150)
down()
#малюємо щоглу

goto(-90, -80)

#малюємо вітрило
goto(-70, -100)
goto(-90, -120)

up()
goto(-180, -190)
down()
goto(-160, -190)

up()
goto(-20, -190)
down()
goto(40, -190)
goto(40, -180)

up()
goto(10, -210)
down()
goto(50, -210)
goto(50, -200)

#малюємо кита
up()
goto(120, -210)
down()
left(90)
circle(30, 180)
goto(130, -210)
goto(130,-190)
goto(120, -210)

#переходимо на кординати ока
up()
goto(80,-200)
down()

#малюэмо око
dot(10)

#переходимо на кординати сонця
up()
goto(-120, 190)
down()

#малюємо сонце
left(90)
circle(30)



done()